fix: Lots of UI fixes.
